       PROGRAM-ID. TAXCALC AS "TAXCALC".

       DATA DIVISION.
       LINKAGE SECTION.
       01  GROSS-PAY-LS    PIC 9(4)V99.
       01  TAX-RATE-LS     PIC V99.
       01  TAX-LS          PIC 9(4)V99. 

       PROCEDURE DIVISION using GROSS-PAY-LS, TAX-RATE-LS, TAX-LS.
           MULTIPLY  GROSS-PAY-LS  BY  TAX-RATE-LS
               GIVING TAX-LS.
       END PROGRAM TAXCALC.
